src/Catalogs/Scan_Контрагенты/Scan_Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_Контрагенты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ГруппаСкания</name>
      <description>Группа Скания</description>
    </items>
    <items>
      <name>Дилеры</name>
      <description>Дилеры</description>
    </items>
    <items>
      <name>Клиенты</name>
      <description>Клиенты</description>
    </items>
    <items>
      <name>Перевозчики</name>
      <description>Перевозчики</description>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
    </items>
  </predefined>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаJenty</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кузовостроитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДоп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОсн</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолноеДоп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолноеОсн</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСокращенноеДоп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <comment>Контрагент больше не используется в программе, но сведения о нем сохранены. Недействительные контрагенты скрываются из всех списков при выборе или подборе в документах, и других местах программы.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Резидент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/Scan_ВидыДоговоров/Scan_ВидыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ВидыДоговоров</name>
  <enumValues>
    <name>Агентский</name>
  </enumValues>
  <enumValues>
    <name>Аренды</name>
  </enumValues>
  <enumValues>
    <name>Перевозки</name>
  </enumValues>
  <enumValues>
    <name>Подряда</name>
  </enumValues>
  <enumValues>
    <name>Соглашение</name>
  </enumValues>
  <enumValues>
    <name>СПокупателем</name>
  </enumValues>
  <enumValues>
    <name>СПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>Хранения</name>
  </enumValues>
  <enumValues>
    <name>ДопСоглашениеКСОП</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникScan_Компании</name>
      <description>Контактная информация справочника &quot;Компании&quot;</description>
    </items>
    <items>
      <name>СправочникScan_КонтактныеЛица</name>
      <description>Контактная информация справочника &quot;Контактные лица&quot;</description>
    </items>
    <items>
      <name>СправочникScan_Контрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникScan_Сотрудники</name>
      <description>Контактная информация справочника &quot;Сотрудники&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Scan_Контрагенты/ManagerModule.bsl
//rarus tenkam 21.10.2016 mantis 6897 ++
Функция ЗаполнитьКонтрагентаИз1БД(НовыйОбъект, ЗначениеПоиска) Экспорт
	ИмяМетода = "GetListOfContragents";
	СообщениеОбОшибке = "";
	Отказ = Ложь;
	СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(ИмяМетода);
	СтруктураПараметров.Вставить("ИНН", ЗначениеПоиска);
		
	ИмяСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетода;
	ТекстОтвета = Scan_ВебСервисы.ВызватьМетод(ИмяМетода, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
	Если НЕ Отказ Тогда
		
		ОбъектКонтрагенты = Scan_ВебСервисы.РазобратьОтветВебСервиса(ТекстОтвета, "Answer.Result.СписокБазовыхОбъектов.Контрагенты", Отказ, ИмяСобытияЖурналаРегистрации, ИмяМетода); 
		Если Отказ Тогда 
			СообщениеОбОшибке = "Не удалось разобрать ответ веб-сервиса. См. журнал регистрации";
			Возврат Ложь;
		КонецЕсли;
		
		Если ОбъектКонтрагенты.Количество() = 0 Тогда
			Возврат Ложь;
		Иначе
			ТекЭлемент = ОбъектКонтрагенты[0]; 
			Для Каждого ЭлементXDTO Из ОбъектКонтрагенты Цикл
				Если ЭлементXDTO.ДатаИзменения > ТекЭлемент.ДатаИзменения Тогда
					ТекЭлемент = ЭлементXDTO;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ИмяМетодаНовое = "GetContragents";
		СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(ИмяМетодаНовое, Ложь);
		СтруктураПараметров.GUID = ТекЭлемент.GUID;
		
		ИмяНовогоСобытияЖурналаРегистрации = "Веб-сервис." + ИмяМетодаНовое;
		ТекЭлементОтвет = Scan_ВебСервисы.ВызватьМетод(ИмяМетодаНовое, СтруктураПараметров, Отказ, ИмяНовогоСобытияЖурналаРегистрации);
		Если Отказ Тогда 
			СообщениеОбОшибке = "Не удалось разобрать ответ веб-сервиса. См. журнал регистрации";
			Возврат Ложь;
		КонецЕсли;
		ОбъектКонтрагент = Scan_ВебСервисы.РазобратьОтветВебСервиса(ТекЭлементОтвет, "Answer.Result.ДанныеКонтрагента", Отказ, ИмяСобытияЖурналаРегистрации, ИмяМетодаНовое);	
		Если Отказ Тогда 
			СообщениеОбОшибке = "Не удалось разобрать ответ веб-сервиса. См. журнал регистрации";
			Возврат Ложь;
		КонецЕсли;
		
		НовыйОбъект.IDExternalSystem = ОбъектКонтрагент.GUID;
		НовыйОбъект.Наименование = ОбъектКонтрагент.Наименование;
		НовыйОбъект.НаименованиеПолное = ОбъектКонтрагент.НаименованиеПолное;
		
		Если ОбъектКонтрагент.ДополнительныеРеквизиты <> Неопределено Тогда
			Для Каждого ТекСвойство Из ОбъектКонтрагент.ДополнительныеРеквизиты.СписокЗначенийСвойств Цикл
				
				Если ТекСвойство.Свойство.Наименование = "Юридический адрес" Тогда
					НоваяКИ = НовыйОбъект.КонтактнаяИнформация.Добавить();	
					НоваяКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
					НоваяКИ.Представление = ТекСвойство.Значение.Строка;
					// rarus tenkam 02.04.2019 mantis 14298 +++
					//НоваяКИ.ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(НоваяКИ.Представление, НоваяКИ.Вид);
					НоваяКИ.Значение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(НоваяКИ.Представление, НоваяКИ.Вид);
					НоваяКИ.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(НоваяКИ.Значение);
					// rarus tenkam 02.04.2019 mantis 14298 ---
					НоваяКИ.Страна = "РОССИЯ";
					НоваяКИ.Тип = НоваяКИ.Вид.Тип;
				ИначеЕсли ТекСвойство.Свойство.Наименование = "Почтовый адрес" Тогда
					НоваяКИ = НовыйОбъект.КонтактнаяИнформация.Добавить();	
					НоваяКИ.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
					НоваяКИ.Представление = ТекСвойство.Значение.Строка;
					// rarus tenkam 02.04.2019 mantis 14298 +++
					//НоваяКИ.ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(НоваяКИ.Представление, НоваяКИ.Вид);
					НоваяКИ.Значение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(НоваяКИ.Представление, НоваяКИ.Вид);
					НоваяКИ.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(НоваяКИ.Значение);
					// rarus tenkam 02.04.2019 mantis 14298 ---
					НоваяКИ.Страна = "РОССИЯ";
					НоваяКИ.Тип = НоваяКИ.Вид.Тип;
				ИначеЕсли ТекСвойство.Свойство.Наименование = "Наименование" Тогда
					НовыйОбъект.Наименование = ТекСвойство.Значение.Строка;	
				ИначеЕсли ТекСвойство.Свойство.Наименование = "Наименование полное" Тогда
					НовыйОбъект.НаименованиеПолное = ТекСвойство.Значение.Строка	
				ИначеЕсли ТекСвойство.Свойство.Наименование = "Контактный телефон" Тогда
					НоваяКИ = НовыйОбъект.КонтактнаяИнформация.Добавить();	
					НоваяКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
					НоваяКИ.Представление = ТекСвойство.Значение.Строка;
					// rarus tenkam 02.04.2019 mantis 14298 +++
					//НоваяКИ.ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(НоваяКИ.Представление, НоваяКИ.Вид);
					НоваяКИ.Значение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(НоваяКИ.Представление, НоваяКИ.Вид);
					НоваяКИ.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(НоваяКИ.Значение);
					// rarus tenkam 02.04.2019 mantis 14298 ---
					НоваяКИ.НомерТелефона = ТекСвойство.Значение.Строка;
					НоваяКИ.НомерТелефонаБезКодов = ТекСвойство.Значение.Строка;
					НоваяКИ.Тип = НоваяКИ.Вид.Тип;	
				ИначеЕсли ТекСвойство.Свойство.Наименование = "Адрес электронной почты" Тогда
					НоваяКИ = НовыйОбъект.КонтактнаяИнформация.Добавить();
					НоваяКИ.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
					НоваяКИ.Представление = ТекСвойство.Значение.Строка;
					// rarus tenkam 02.04.2019 mantis 14298 +++
					//НоваяКИ.ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебныйВызовСервера.КонтактнаяИнформацияXMLПоПредставлению(НоваяКИ.Представление, НоваяКИ.Вид);
					НоваяКИ.Значение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(НоваяКИ.Представление, НоваяКИ.Вид);
					НоваяКИ.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(НоваяКИ.Значение);
					// rarus tenkam 02.04.2019 mantis 14298 ---
					НоваяКИ.АдресЭП = ТекСвойство.Значение.Строка;
					Поз = СтрНайти(НоваяКИ.Представление, "@");
					Если Поз <> 0 Тогда
						НоваяКИ.ДоменноеИмяСервера = Сред(НоваяКИ.Представление, Поз+1);
					КонецЕсли;
					НоваяКИ.Тип = НоваяКИ.Вид.Тип;
				Иначе
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		НовыйОбъект.Комментарий = "Заполнен по данным из 1БД";
		НовыйОбъект.ДатаОбновления = ТекущаяДата();
	КонецЕсли;	
	Если Отказ Тогда
		Сообщить(ТекстОтвета); 
		Если СообщениеОбОшибке <> "" Тогда
			Сообщить(СообщениеОбОшибке);
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции
//rarus tenkam 21.10.2016 mantis 6897 --

//rarus vikhle 29.06.2020 mt 15888 +++
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	    //rarus ozhnik 16347 20.07.2020 + 
	
		СтандартнаяОбработка = Ложь;
			Если ЗначениеЗаполнено(Параметры.СтрокаПоиска) ТОгда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
			|	Scan_Контрагенты.Ссылка.Наименование КАК Представление,
			|	Scan_Контрагенты.Ссылка КАК Значение,
			|	Scan_Контрагенты.ИНН КАК ИНН
			|ИЗ
			|	Справочник.Scan_Контрагенты КАК Scan_Контрагенты
			|ГДЕ
			|	Scan_Контрагенты.Наименование ПОДОБНО &СтрокаПоиска
			|	И Scan_Контрагенты.Недействителен = ЛОЖЬ";	// rarus tenkam 03.08.2020 mantis 16401 +
			
			Запрос.УстановитьПараметр("СтрокаПоиска", Параметры.СтрокаПоиска + "%");
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			ДанныеВыбора = Новый СписокЗначений;
			Пока Выборка.Следующий() Цикл
				ПредставлениеКонтрагента = Новый ФорматированнаяСтрока(
				Новый ФорматированнаяСтрока(
				Лев(Выборка.Представление, СтрДлина(Параметры.СтрокаПоиска)),
				Новый Шрифт(,, Истина),
				ЦветаСтиля.РезультатУспехЦвет),
				Сред(Выборка.Представление, СтрДлина(Параметры.СтрокаПоиска) + 1)+ " " + Выборка.ИНН);
				
				ДанныеВыбора.Добавить(Выборка.Значение, ПредставлениеКонтрагента);
				
			КонецЦикла; 
		КонецЕсли;
		//rarus ozhnik 16347 20.07.2020 - 
КонецПроцедуры

//rarus vikhle 29.06.2020 mt 15888 ---

Процедура ОбработатьНедействительногоКонтрагента(КонтрагентСсылка) Экспорт	// rarus tenkam 02.08.2020 mantis 16401 +++
	Если НЕ ЗначениеЗаполнено(КонтрагентСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ КонтрагентСсылка.Недействителен Тогда
		Возврат;
	КонецЕсли;
	
	// Установим признак Недействителен для КЛ
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_КонтактныеЛица.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Scan_КонтактныеЛица КАК Scan_КонтактныеЛица
		|ГДЕ
		|	Scan_КонтактныеЛица.Владелец = &КонтрагентСсылка
		|	И Scan_КонтактныеЛица.Недействителен = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("КонтрагентСсылка", КонтрагентСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КЛОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		КЛОбъект.Недействителен = Истина;
		
		Попытка
			КЛОбъект.Записать();
		Исключение
			ВывестиСообщениеПол(НСтр("ru = 'Не удалось установить признак Недействителен у контактного лица <%1>: %2'"),,,,, КЛОбъект, ОписаниеОшибки());
		КонецПопытки;		
	КонецЦикла;
	
	// Установим признак Недействителен для мест хранения
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_МестаХранения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Scan_МестаХранения КАК Scan_МестаХранения
		|ГДЕ
		|	Scan_МестаХранения.Контрагент = &КонтрагентСсылка
		|	И Scan_МестаХранения.Недействительный = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("КонтрагентСсылка", КонтрагентСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МестоХраненияОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		МестоХраненияОбъект.Недействительный = Истина;
		
		Попытка
			МестоХраненияОбъект.Записать();
		Исключение
			ВывестиСообщениеПол(НСтр("ru = 'Не удалось установить признак Недействительный у места хранения <%1>: %2'"),,,,, МестоХраненияОбъект, ОписаниеОшибки());
		КонецПопытки;		
	КонецЦикла;
	
	// Установим признак Недействителен для договоров взаиморасчетов с видом Подряда и Хранения
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_ДоговорыВзаиморасчетов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Scan_ДоговорыВзаиморасчетов КАК Scan_ДоговорыВзаиморасчетов
		|ГДЕ
		|	Scan_ДоговорыВзаиморасчетов.Владелец = &КонтрагентСсылка
		|	И (Scan_ДоговорыВзаиморасчетов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.Scan_ВидыДоговоров.Подряда)
		|			ИЛИ Scan_ДоговорыВзаиморасчетов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.Scan_ВидыДоговоров.Хранения)
		|			ИЛИ Scan_ДоговорыВзаиморасчетов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.Scan_ВидыДоговоров.Перевозки))	// rarus tenkam 24.03.2021 mantis 17101 +
		|	И Scan_ДоговорыВзаиморасчетов.Недействителен = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("КонтрагентСсылка", КонтрагентСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДоговорОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ДоговорОбъект.Недействителен = Истина;
		// rarus tenkam 24.03.2021 mantis 17101 +++
		Если НЕ ЗначениеЗаполнено(ДоговорОбъект.ДатаОкончанияДействия) Тогда
			ДоговорОбъект.ДатаОкончанияДействия = КонтрагентСсылка.ДатаОкончанияДействия;
		КонецЕсли;		
		// rarus tenkam 24.03.2021 mantis 17101 ---
		Попытка
			ДоговорОбъект.Записать();
		Исключение
			ВывестиСообщениеПол(НСтр("ru = 'Не удалось установить признак Недействителен у договора взаиморасчетов <%1>: %2'"),,,,, ДоговорОбъект, ОписаниеОшибки());
		КонецПопытки;		
	КонецЦикла;   	
	
КонецПроцедуры	// rarus tenkam 02.08.2020 mantis 16401 ---
